// Необходимо расширить список стандартных методов массива,
// путем добавления новой функции объединения двух массивов.
// Расширяемый метод не должен переопределять метод массива, если такой уже определен.
// Результатом работы функции является новый массив,
// включающий элементы первого и второго массива, отсортированные в порядке возрастания.
// В реализация функции запрещено использовать сортировку массивов.
// Если исходные массивы не отсортированы в порядке возрастания, необходимо вызвать исключение.

// Пример:
// [1, 3, 4], [1, 2, 6] -> [1, 1, 2, 3, 4, 6]
// [1, 2, 3, 4], [2, 5, 10] -> [1, 2, 2, 3, 4, 5, 10]
// [1, 3, 2], [1, 2, 3] -> Error